# 06 - Combining datasets

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [2]:
import numpy as np
import pandas as pd

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [20]:
s1 = np.random.randint(1,5, 100)
s2 = np.random.randint(0,4, 100)
s3 = np.random.randint(10000, 30001, 100)

### Step 3. Let's create a DataFrame by joinning the Series by column

In [23]:
df = pd.DataFrame({'s1': s1, 's2': s2, 's3': s3})
df

    s1  s2     s3
0    1   3  19301
1    2   0  11267
2    2   3  17303
3    2   1  21890
4    2   1  10341
..  ..  ..    ...
95   4   2  26831
96   1   0  22817
97   4   1  11533
98   1   0  29091
99   1   0  11186

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [24]:
df.columns = ['bedrs', 'bathrs', 'price_sqr_meter']
df

    bedrs  bathrs  price_sqr_meter
0       1       3            19301
1       2       0            11267
2       2       3            17303
3       2       1            21890
4       2       1            10341
..    ...     ...              ...
95      4       2            26831
96      1       0            22817
97      4       1            11533
98      1       0            29091
99      1       0            11186

[100 rows x 3 columns]

### Step 5. Create a column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [30]:
df['bigcolumn'] = list(zip(df.bedrs, df.bathrs, df.price_sqr_meter))
df

    bedrs  bathrs  price_sqr_meter      bigcolumn
0       1       3            19301  (1, 3, 19301)
1       2       0            11267  (2, 0, 11267)
2       2       3            17303  (2, 3, 17303)
3       2       1            21890  (2, 1, 21890)
4       2       1            10341  (2, 1, 10341)
..    ...     ...              ...            ...
95      4       2            26831  (4, 2, 26831)
96      1       0            22817  (1, 0, 22817)
97      4       1            11533  (4, 1, 11533)
98      1       0            29091  (1, 0, 29091)
99      1       0            11186  (1, 0, 11186)

[100 rows x 4 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [36]:
df.index.values[-1] == 99

True

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [38]:
df.reindex(range(300))

     bedrs  bathrs  price_sqr_meter      bigcolumn
0      1.0     3.0          19301.0  (1, 3, 19301)
1      2.0     0.0          11267.0  (2, 0, 11267)
2      2.0     3.0          17303.0  (2, 3, 17303)
3      2.0     1.0          21890.0  (2, 1, 21890)
4      2.0     1.0          10341.0  (2, 1, 10341)
..     ...     ...              ...            ...
295    NaN     NaN              NaN            NaN
296    NaN     NaN              NaN            NaN
297    NaN     NaN              NaN            NaN
298    NaN     NaN              NaN            NaN
299    NaN     NaN              NaN            NaN

[300 rows x 4 columns]